betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_eth.h
/********************************** (C) COPYRIGHT
 * ******************************* File Name          : ch32h417_eth.h Author
 *          : WCH Version            : V1.0.0 Date               : 2021/06/06
 * Description        : This file contains all the functions prototypes for the
 *                      ETH firmware library.
 *********************************************************************************
 * Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
 * Attention: This software (modified or not) and binary are used for
 * microcontroller manufactured by Nanjing Qinheng Microelectronics.
 *******************************************************************************/
#ifndef __CH32H417_ETH_H
#define __CH32H417_ETH_H

#ifdef __cplusplus
extern "C" {
#endif

#include "ch32h417.h"

#define PHY_10BASE_T_LINKED 1
#define PHY_10BASE_T_NOT_LINKED 0

#define DMA_TPS_Mask ((uint32_t)0x00700000)
#define DMA_RPS_Mask ((uint32_t)0x000E0000)

/* ETH Init structure definition */
typedef struct {
  uint32_t
      ETH_AutoNegotiation; /* Selects or not the AutoNegotiation mode for the
                              external PHY The AutoNegotiation allows an
                              automatic setting of the Speed (10/100Mbps) and
                              the mode (half/full-duplex). This parameter can be
                              a value of @ref ETH_AutoNegotiation */

  uint32_t ETH_Watchdog; /* Selects or not the Watchdog timer
                            When enabled, the MAC allows no more then 2048 bytes
                            to be received. When disabled, the MAC can receive
                            up to 16384 bytes. This parameter can be a value of
                            @ref ETH_watchdog */

  uint32_t
      ETH_Jabber; /* Selects or not Jabber timer
                     When enabled, the MAC allows no more then 2048 bytes to be
                     sent. When disabled, the MAC can send up to 16384 bytes.
                     This parameter can be a value of @ref ETH_Jabber */

  uint32_t ETH_InterFrameGap; /* Selects the minimum IFG between frames during
                                 transmission This parameter can be a value of
                                 @ref ETH_Inter_Frame_Gap */

  uint32_t ETH_CarrierSense; /* Selects or not the Carrier Sense
                                This parameter can be a value of @ref
                                ETH_Carrier_Sense */

  uint32_t ETH_Speed; /* Sets the Ethernet speed: 10/100 Mbps
                         This parameter can be a value of @ref ETH_Speed */

  uint32_t
      ETH_ReceiveOwn; /* Selects or not the ReceiveOwn
                         ReceiveOwn allows the reception of frames when the
                         TX_EN signal is asserted in Half-Duplex mode This
                         parameter can be a value of @ref ETH_Receive_Own */

  uint32_t ETH_LoopbackMode; /* Selects or not the internal MAC MII Loopback
                                mode This parameter can be a value of @ref
                                ETH_Loop_Back_Mode */

  uint32_t
      ETH_Mode; /* Selects the MAC duplex mode: Half-Duplex or Full-Duplex mode
                   This parameter can be a value of @ref ETH_Duplex_Mode */

  uint32_t ETH_ChecksumOffload; /* Selects or not the IPv4 checksum checking for
                                   received frame payloads' TCP/UDP/ICMP
                                   headers. This parameter can be a value of
                                   @ref ETH_Checksum_Offload */

  uint32_t ETH_RetryTransmission; /* Selects or not the MAC attempt retries
                                     transmission, based on the settings of BL,
                                     when a colision occurs (Half-Duplex mode)
                                     This parameter can be a value of @ref
                                     ETH_Retry_Transmission */

  uint32_t ETH_AutomaticPadCRCStrip; /* Selects or not the Automatic MAC Pad/CRC
                                        Stripping This parameter can be a value
                                        of @ref ETH_Automatic_Pad_CRC_Strip */

  uint32_t ETH_BackOffLimit; /* Selects the BackOff limit value
                                This parameter can be a value of @ref
                                ETH_Back_Off_Limit */

  uint32_t ETH_DeferralCheck; /* Selects or not the deferral check function
                                 (Half-Duplex mode) This parameter can be a
                                 value of @ref ETH_Deferral_Check */

  uint32_t ETH_ReceiveAll; /* Selects or not all frames reception by the MAC (No
                              fitering) This parameter can be a value of @ref
                              ETH_Receive_All */

  uint32_t ETH_SourceAddrFilter; /* Selects the Source Address Filter mode
                                    This parameter can be a value of @ref
                                    ETH_Source_Addr_Filter */

  uint32_t ETH_PassControlFrames; /* Sets the forwarding mode of the control
                                     frames (including unicast and multicast
                                     PAUSE frames) This parameter can be a value
                                     of @ref ETH_Pass_Control_Frames */

  uint32_t
      ETH_BroadcastFramesReception; /* Selects or not the reception of Broadcast
                                       Frames This parameter can be a value of
                                       @ref ETH_Broadcast_Frames_Reception */

  uint32_t ETH_DestinationAddrFilter; /* Sets the destination filter mode for
                                         both unicast and multicast frames This
                                         parameter can be a value of @ref
                                         ETH_Destination_Addr_Filter */

  uint32_t ETH_PromiscuousMode; /* Selects or not the Promiscuous Mode
                                   This parameter can be a value of @ref
                                   ETH_Promiscuous_Mode */

  uint32_t
      ETH_MulticastFramesFilter; /* Selects the Multicast Frames filter mode:
                                    None/HashTableFilter/PerfectFilter/PerfectHashTableFilter
                                    This parameter can be a value of @ref
                                    ETH_Multicast_Frames_Filter */

  uint32_t
      ETH_UnicastFramesFilter; /* Selects the Unicast Frames filter mode:
                                  HashTableFilter/PerfectFilter/PerfectHashTableFilter
                                  This parameter can be a value of @ref
                                  ETH_Unicast_Frames_Filter */

  uint32_t ETH_HashTableHigh; /* This field holds the higher 32 bits of Hash
                                 table.  */

  uint32_t
      ETH_HashTableLow; /* This field holds the lower 32 bits of Hash table.  */

  uint32_t ETH_PauseTime; /* This field holds the value to be used in the Pause
                             Time field in the transmit control frame */

  uint32_t
      ETH_ZeroQuantaPause; /* Selects or not the automatic generation of
                              Zero-Quanta Pause Control frames This parameter
                              can be a value of @ref ETH_Zero_Quanta_Pause */

  uint32_t
      ETH_PauseLowThreshold; /* This field configures the threshold of the PAUSE
                                to be checked for automatic retransmission of
                                PAUSE Frame This parameter can be a value of
                                @ref ETH_Pause_Low_Threshold */

  uint32_t
      ETH_UnicastPauseFrameDetect; /* Selects or not the MAC detection of the
                                      Pause frames (with MAC Address0 unicast
                                      address and unique multicast address) This
                                      parameter can be a value of @ref
                                      ETH_Unicast_Pause_Frame_Detect */

  uint32_t ETH_ReceiveFlowControl; /* Enables or disables the MAC to decode the
                                      received Pause frame and disable its
                                      transmitter for a specified time (Pause
                                      Time) This parameter can be a value of
                                      @ref ETH_Receive_Flow_Control */

