betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_eth.h
  uint32_t ETH_TransmitFlowControl; /* Enables or disables the MAC to transmit
                                       Pause frames (Full-Duplex mode) or the
                                       MAC back-pressure operation (Half-Duplex
                                       mode) This parameter can be a value of
                                       @ref ETH_Transmit_Flow_Control */

  uint32_t ETH_VLANTagComparison; /* Selects the 12-bit VLAN identifier or the
                                     complete 16-bit VLAN tag for comparison and
                                     filtering This parameter can be a value of
                                     @ref ETH_VLAN_Tag_Comparison */

  uint32_t ETH_VLANTagIdentifier; /* Holds the VLAN tag identifier for receive
                                     frames */

  uint32_t
      ETH_DropTCPIPChecksumErrorFrame; /* Selects or not the Dropping of
                                          TCP/IP Checksum Error Frames This
                                          parameter can be a value of @ref
                                          ETH_Drop_TCP_IP_Checksum_Error_Frame
                                        */

  uint32_t
      ETH_ReceiveStoreForward; /* Enables or disables the Receive store and
                                  forward mode This parameter can be a value of
                                  @ref ETH_Receive_Store_Forward */

  uint32_t ETH_FlushReceivedFrame; /* Enables or disables the flushing of
                                      received frames This parameter can be a
                                      value of @ref ETH_Flush_Received_Frame */

  uint32_t
      ETH_TransmitStoreForward; /* Enables or disables Transmit store and
                                   forward mode This parameter can be a value of
                                   @ref ETH_Transmit_Store_Forward */

  uint32_t
      ETH_TransmitThresholdControl; /* Selects or not the Transmit Threshold
                                       Control This parameter can be a value of
                                       @ref ETH_Transmit_Threshold_Control */

  uint32_t ETH_ForwardErrorFrames; /* Selects or not the forward to the DMA of
                                      erroneous frames This parameter can be a
                                      value of @ref ETH_Forward_Error_Frames */

  uint32_t
      ETH_ForwardUndersizedGoodFrames; /* Enables or disables the Rx FIFO to
                                          forward Undersized frames (frames with
                                          no Error and length less than 64
                                          bytes) including pad-bytes and CRC)
                                          This parameter can be a value of @ref
                                          ETH_Forward_Undersized_Good_Frames */

  uint32_t
      ETH_ReceiveThresholdControl; /* Selects the threshold level of the Receive
                                      FIFO This parameter can be a value of @ref
                                      ETH_Receive_Threshold_Control */

  uint32_t ETH_SecondFrameOperate; /* Selects or not the Operate on second frame
                                      mode, which allows the DMA to process a
                                      second frame of Transmit data even before
                                      obtaining the status for the first frame.
                                      This parameter can be a value of @ref
                                      ETH_Second_Frame_Operate */

  uint32_t ETH_AddressAlignedBeats; /* Enables or disables the Address Aligned
                                       Beats This parameter can be a value of
                                       @ref ETH_Address_Aligned_Beats */

  uint32_t ETH_FixedBurst; /* Enables or disables the AHB Master interface fixed
                              burst transfers This parameter can be a value of
                              @ref ETH_Fixed_Burst */

  uint32_t ETH_RxDMABurstLength; /* Indicates the maximum number of beats to be
                                    transferred in one Rx DMA transaction This
                                    parameter can be a value of @ref
                                    ETH_Rx_DMA_Burst_Length */

  uint32_t ETH_TxDMABurstLength; /* Indicates sthe maximum number of beats to be
                                    transferred in one Tx DMA transaction This
                                    parameter can be a value of @ref
                                    ETH_Tx_DMA_Burst_Length */

  uint32_t
      ETH_DescriptorSkipLength; /* Specifies the number of word to skip between
                                   two unchained descriptors (Ring mode) */

  uint32_t ETH_DMAArbitration; /* Selects the DMA Tx/Rx arbitration
                                  This parameter can be a value of @ref
                                  ETH_DMA_Arbitration */
} ETH_InitTypeDef;

/* ETH delay.Just for Ethernet */
#define _eth_delay_                                                            \
  ETH_Delay /* Default _eth_delay_ function with less precise timing */

/* definition for Ethernet frame */
#define ETH_MAX_PACKET_SIZE                                                    \
  1536 /* ETH_HEADER + ETH_EXTRA + MAX_ETH_PAYLOAD + ETH_CRC */
#define ETH_HEADER                                                             \
  14                /* 6 byte Dest addr, 6 byte Src addr, 2 byte length/type */
#define ETH_CRC 4   /* Ethernet CRC */
#define ETH_EXTRA 2 /* Extra bytes in some cases */
#define VLAN_TAG 4  /* optional 802.1q VLAN Tag */
#define MIN_ETH_PAYLOAD 46       /* Minimum Ethernet payload size */
#define MAX_ETH_PAYLOAD 1500     /* Maximum Ethernet payload size */
#define JUMBO_FRAME_PAYLOAD 9000 /* Jumbo frame payload size */

/* ETH DMA structure definition */
typedef struct {
  uint32_t volatile Status;     /* Status */
  uint32_t ControlBufferSize;   /* Control and Buffer1, Buffer2 lengths */
  uint32_t Buffer1Addr;         /* Buffer1 address pointer */
  uint32_t Buffer2NextDescAddr; /* Buffer2 or next descriptor address pointer */
} ETH_DMADESCTypeDef;

/**
   DMA Tx Desciptor
  -----------------------------------------------------------------------------------------------
  TDES0 | OWN(31) | CTRL[30:26] | Reserved[25:24] | CTRL[23:20] |
  Reserved[19:17] | Status[16:0] |
  -----------------------------------------------------------------------------------------------
  TDES1 | Reserved[31:29] | Buffer2 ByteCount[28:16] | Reserved[15:13] | Buffer1
  ByteCount[12:0] |
  -----------------------------------------------------------------------------------------------
  TDES2 |                         Buffer1 Address [31:0] |
  -----------------------------------------------------------------------------------------------
  TDES3 |                   Buffer2 Address [31:0] / Next Desciptor Address
  [31:0]               |
  ------------------------------------------------------------------------------------------------
*/

