betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_eth.h
/* Timeout threshold of Reading or writing PHY registers */
#define PHY_READ_TO ((uint32_t)0x004FFFFF)
#define PHY_WRITE_TO ((uint32_t)0x0004FFFF)

/* Delay time after reset PHY */
#define PHY_ResetDelay ((uint32_t)0x000FFFFF)

/* Delay time after configure PHY */
#define PHY_ConfigDelay ((uint32_t)0x00FFFFFF)

/* PHY basic register */
#define PHY_BCR 0x0   /*PHY transceiver Basic Control Register */
#define PHY_BSR 0x01  /*PHY transceiver Basic Status Register*/
#define PHY_ANAR 0x04 /* Auto-Negotiation Advertisement Register */
#define PHY_ANLPAR                                                             \
  0x05 /* Auto-Negotiation Link Partner Base  Page Ability Register*/
#define PHY_ANER 0x06 /* Auto-Negotiation Expansion Register */
#define PHY_BMCR PHY_BCR
#define PHY_BMSR PHY_BSR
#define PHY_STATUS 0x10
#define PHY_MDIX 0x1E

/* Bit or field definition for PHY basic control register */
#define PHY_Reset ((uint16_t)0x8000)    /* PHY Reset */
#define PHY_Loopback ((uint16_t)0x4000) /* Select loop-back mode */
#define PHY_FULLDUPLEX_100M                                                    \
  ((uint16_t)0x2100) /* Set the full-duplex mode at 100 Mb/s */
#define PHY_HALFDUPLEX_100M                                                    \
  ((uint16_t)0x2000) /* Set the half-duplex mode at 100 Mb/s */
#define PHY_FULLDUPLEX_10M                                                     \
  ((uint16_t)0x0100) /* Set the full-duplex mode at 10 Mb/s */
#define PHY_HALFDUPLEX_10M                                                     \
  ((uint16_t)0x0000) /* Set the half-duplex mode at 10 Mb/s */
#define PHY_AutoNegotiation                                                    \
  ((uint16_t)0x1000) /* Enable auto-negotiation function */
#define PHY_Restart_AutoNegotiation                                            \
  ((uint16_t)0x0200)                     /* Restart auto-negotiation function */
#define PHY_Powerdown ((uint16_t)0x0800) /* Select the power down mode */
#define PHY_Isolate ((uint16_t)0x0400)   /* Isolate PHY from MII */

/* Bit or field definition for PHY basic status register */
#define PHY_AutoNego_Complete                                                  \
  ((uint16_t)0x0020) /* Auto-Negotioation process completed */
#define PHY_Linked_Status ((uint16_t)0x0004) /* Valid link established */
#define PHY_Jabber_detection                                                   \
  ((uint16_t)0x0002)                     /* Jabber condition detected          \
                                          */
#define PHY_RMII_Mode ((uint16_t)0x0020) /* RMII */

/* Internal 10BASE-T PHY 50R*4 pull-up resistance enable or disable */
#define ETH_Internal_Pull_Up_Res_Enable ((uint32_t)0x00100000)
#define ETH_Internal_Pull_Up_Res_Disable ((uint32_t)0x00000000)

/* MAC autoNegotiation enable or disable */
#define ETH_AutoNegotiation_Enable ((uint32_t)0x00000001)
#define ETH_AutoNegotiation_Disable ((uint32_t)0x00000000)

/* MAC watchdog enable or disable */
#define ETH_Watchdog_Enable ((uint32_t)0x00000000)
#define ETH_Watchdog_Disable ((uint32_t)0x00800000)

/* Bit description - MAC jabber enable or disable */
#define ETH_Jabber_Enable ((uint32_t)0x00000000)
#define ETH_Jabber_Disable ((uint32_t)0x00400000)

/* Value of minimum IFG between frames during transmission */
#define ETH_InterFrameGap_96Bit                                                \
  ((uint32_t)0x00000000) /* minimum IFG between frames during transmission is  \
                            96Bit */
#define ETH_InterFrameGap_88Bit                                                \
  ((uint32_t)0x00020000) /* minimum IFG between frames during transmission is  \
                            88Bit */
#define ETH_InterFrameGap_80Bit                                                \
  ((uint32_t)0x00040000) /* minimum IFG between frames during transmission is  \
                            80Bit */
#define ETH_InterFrameGap_72Bit                                                \
  ((uint32_t)0x00060000) /* minimum IFG between frames during transmission is  \
                            72Bit */
#define ETH_InterFrameGap_64Bit                                                \
  ((uint32_t)0x00080000) /* minimum IFG between frames during transmission is  \
                            64Bit */
#define ETH_InterFrameGap_56Bit                                                \
  ((uint32_t)0x000A0000) /* minimum IFG between frames during transmission is  \
                            56Bit */
#define ETH_InterFrameGap_48Bit                                                \
  ((uint32_t)0x000C0000) /* minimum IFG between frames during transmission is  \
                            48Bit */
#define ETH_InterFrameGap_40Bit                                                \
  ((uint32_t)0x000E0000) /* minimum IFG between frames during transmission is  \
                            40Bit */

/* MAC carrier sense enable or disable */
#define ETH_CarrierSense_Enable ((uint32_t)0x00000000)
#define ETH_CarrierSense_Disable ((uint32_t)0x00010000)

/* MAC speed */
#define ETH_Speed_10M ((uint32_t)0x00000000)
#define ETH_Speed_100M ((uint32_t)0x00004000)
#define ETH_Speed_1000M ((uint32_t)0x00008000)

/* MAC receive own enable or disable */
#define ETH_ReceiveOwn_Enable ((uint32_t)0x00000000)
#define ETH_ReceiveOwn_Disable ((uint32_t)0x00002000)

/* MAC Loopback mode enable or disable */
#define ETH_LoopbackMode_Enable ((uint32_t)0x00001000)
#define ETH_LoopbackMode_Disable ((uint32_t)0x00000000)

/* MAC fullDuplex or halfDuplex */
#define ETH_Mode_FullDuplex ((uint32_t)0x00000800)
#define ETH_Mode_HalfDuplex ((uint32_t)0x00000000)

/* MAC offload checksum enable or disable */
#define ETH_ChecksumOffload_Enable ((uint32_t)0x00000400)
#define ETH_ChecksumOffload_Disable ((uint32_t)0x00000000)

/* MAC transmission retry enable or disable */
#define ETH_RetryTransmission_Enable ((uint32_t)0x00000000)
#define ETH_RetryTransmission_Disable ((uint32_t)0x00000200)

/* MAC automatic pad CRC strip enable or disable */
#define ETH_AutomaticPadCRCStrip_Enable ((uint32_t)0x00000080)
#define ETH_AutomaticPadCRCStrip_Disable ((uint32_t)0x00000000)

/* MAC backoff limitation */
#define ETH_BackOffLimit_10 ((uint32_t)0x00000000)
#define ETH_BackOffLimit_8 ((uint32_t)0x00000020)
#define ETH_BackOffLimit_4 ((uint32_t)0x00000040)
#define ETH_BackOffLimit_1 ((uint32_t)0x00000060)

/* MAC deferral check enable or disable */
#define ETH_DeferralCheck_Enable ((uint32_t)0x00000010)
#define ETH_DeferralCheck_Disable ((uint32_t)0x00000000)

