betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_eth.h
/* Bit description  : MAC receive all frame enable or disable */
#define ETH_ReceiveAll_Enable ((uint32_t)0x80000000)
#define ETH_ReceiveAll_Disable ((uint32_t)0x00000000)

/* MAC backoff limitation */
#define ETH_SourceAddrFilter_Normal_Enable ((uint32_t)0x00000200)
#define ETH_SourceAddrFilter_Inverse_Enable ((uint32_t)0x00000300)
#define ETH_SourceAddrFilter_Disable ((uint32_t)0x00000000)

/* MAC Pass control frames */
#define ETH_PassControlFrames_BlockAll                                         \
  ((uint32_t)0x00000040) /* MAC filters all control frames from reaching the   \
                            application */
#define ETH_PassControlFrames_ForwardAll                                       \
  ((uint32_t)0x00000080) /* MAC forwards all control frames to application     \
                            even if they fail the Address Filter */
#define ETH_PassControlFrames_ForwardPassedAddrFilter                          \
  ((uint32_t)0x000000C0) /* MAC forwards control frames that pass the Address  \
                            Filter. */

/* MAC broadcast frames reception */
#define ETH_BroadcastFramesReception_Enable ((uint32_t)0x00000000)
#define ETH_BroadcastFramesReception_Disable ((uint32_t)0x00000020)

/* MAC destination address filter */
#define ETH_DestinationAddrFilter_Normal ((uint32_t)0x00000000)
#define ETH_DestinationAddrFilter_Inverse ((uint32_t)0x00000008)

/* MAC Promiscuous mode enable or disable */
#define ETH_PromiscuousMode_Enable ((uint32_t)0x00000001)
#define ETH_PromiscuousMode_Disable ((uint32_t)0x00000000)

/* MAC multicast frames filter */
#define ETH_MulticastFramesFilter_PerfectHashTable ((uint32_t)0x00000404)
#define ETH_MulticastFramesFilter_HashTable ((uint32_t)0x00000004)
#define ETH_MulticastFramesFilter_Perfect ((uint32_t)0x00000000)
#define ETH_MulticastFramesFilter_None ((uint32_t)0x00000010)

/* MAC unicast frames filter */
#define ETH_UnicastFramesFilter_PerfectHashTable ((uint32_t)0x00000402)
#define ETH_UnicastFramesFilter_HashTable ((uint32_t)0x00000002)
#define ETH_UnicastFramesFilter_Perfect ((uint32_t)0x00000000)

/* Bit description  : MAC zero quanta pause */
#define ETH_ZeroQuantaPause_Enable ((uint32_t)0x00000000)
#define ETH_ZeroQuantaPause_Disable ((uint32_t)0x00000080)

/* Field description  : MAC pause low threshold */
#define ETH_PauseLowThreshold_Minus4                                           \
  ((uint32_t)0x00000000) /* Pause time minus 4 slot times */
#define ETH_PauseLowThreshold_Minus28                                          \
  ((uint32_t)0x00000010) /* Pause time minus 28 slot times */
#define ETH_PauseLowThreshold_Minus144                                         \
  ((uint32_t)0x00000020) /* Pause time minus 144 slot times */
#define ETH_PauseLowThreshold_Minus256                                         \
  ((uint32_t)0x00000030) /* Pause time minus 256 slot times */

/* MAC unicast pause frame detect enable or disable*/
#define ETH_UnicastPauseFrameDetect_Enable ((uint32_t)0x00000008)
#define ETH_UnicastPauseFrameDetect_Disable ((uint32_t)0x00000000)

/* MAC receive flow control frame enable or disable */
#define ETH_ReceiveFlowControl_Enable ((uint32_t)0x00000004)
#define ETH_ReceiveFlowControl_Disable ((uint32_t)0x00000000)

/* MAC transmit flow control enable or disable */
#define ETH_TransmitFlowControl_Enable ((uint32_t)0x00000002)
#define ETH_TransmitFlowControl_Disable ((uint32_t)0x00000000)

/* MAC VLAN tag comparison */
#define ETH_VLANTagComparison_12Bit ((uint32_t)0x00010000)
#define ETH_VLANTagComparison_16Bit ((uint32_t)0x00000000)

/* MAC flag */
#define ETH_MAC_FLAG_TST                                                       \
  ((uint32_t)0x00000200) /* Time stamp trigger flag (on MAC) */
#define ETH_MAC_FLAG_MMCT ((uint32_t)0x00000040) /* MMC transmit flag  */
#define ETH_MAC_FLAG_MMCR ((uint32_t)0x00000020) /* MMC receive flag */
#define ETH_MAC_FLAG_MMC ((uint32_t)0x00000010)  /* MMC flag (on MAC) */
#define ETH_MAC_FLAG_PMT ((uint32_t)0x00000008)  /* PMT flag (on MAC) */

/* MAC interrupt */
#define ETH_MAC_IT_TST                                                         \
  ((uint32_t)0x00000200) /* Time stamp trigger interrupt (on MAC) */
#define ETH_MAC_IT_MMCT ((uint32_t)0x00000040) /* MMC transmit interrupt */
#define ETH_MAC_IT_MMCR ((uint32_t)0x00000020) /* MMC receive interrupt */
#define ETH_MAC_IT_MMC ((uint32_t)0x00000010)  /* MMC interrupt (on MAC) */
#define ETH_MAC_IT_PMT ((uint32_t)0x00000008)  /* PMT interrupt (on MAC) */

/* MAC address */
#define ETH_MAC_Address0 ((uint32_t)0x00000000)
#define ETH_MAC_Address1 ((uint32_t)0x00000008)
#define ETH_MAC_Address2 ((uint32_t)0x00000010)
#define ETH_MAC_Address3 ((uint32_t)0x00000018)

/* MAC address filter select */
#define ETH_MAC_AddressFilter_SA ((uint32_t)0x00000000)
#define ETH_MAC_AddressFilter_DA ((uint32_t)0x00000008)

/* MAC address mask */
#define ETH_MAC_AddressMask_Byte6                                              \
  ((uint32_t)0x20000000) /* Mask MAC Address high reg bits [15:8] */
#define ETH_MAC_AddressMask_Byte5                                              \
  ((uint32_t)0x10000000) /* Mask MAC Address high reg bits [7:0] */
#define ETH_MAC_AddressMask_Byte4                                              \
  ((uint32_t)0x08000000) /* Mask MAC Address low reg bits [31:24] */
#define ETH_MAC_AddressMask_Byte3                                              \
  ((uint32_t)0x04000000) /* Mask MAC Address low reg bits [23:16] */
#define ETH_MAC_AddressMask_Byte2                                              \
  ((uint32_t)0x02000000) /* Mask MAC Address low reg bits [15:8] */
#define ETH_MAC_AddressMask_Byte1                                              \
  ((uint32_t)0x01000000) /* Mask MAC Address low reg bits [70] */

/******************************************************************************/
/*                                                                            */
/*                          MAC Descriptor Register */
/*                                                                            */
/******************************************************************************/

/* DMA descriptor segment */
#define ETH_DMATxDesc_LastSegment ((uint32_t)0x40000000)  /* Last Segment */
#define ETH_DMATxDesc_FirstSegment ((uint32_t)0x20000000) /* First Segment */

/* DMA descriptor checksum setting */
#define ETH_DMATxDesc_ChecksumByPass                                           \
  ((uint32_t)0x00000000) /* Checksum engine bypass */
#define ETH_DMATxDesc_ChecksumIPV4Header                                       \
  ((uint32_t)0x00400000) /* IPv4 header checksum insertion  */
#define ETH_DMATxDesc_ChecksumTCPUDPICMPSegment                                \
  ((uint32_t)0x00800000) /* TCP/UDP/ICMP checksum insertion. Pseudo header     \
                            checksum is assumed to be present */
#define ETH_DMATxDesc_ChecksumTCPUDPICMPFull                                   \
  ((uint32_t)0x00C00000) /* TCP/UDP/ICMP checksum fully in hardware including  \
                            pseudo header */

/* DMA RX & TX buffer */
#define ETH_DMARxDesc_Buffer1 ((uint32_t)0x00000000) /* DMA Rx Desc Buffer1 */
#define ETH_DMARxDesc_Buffer2 ((uint32_t)0x00000001) /* DMA Rx Desc Buffer2 */

/******************************************************************************/
/*                                                                            */
/*                          ETH DMA Register */
/*                                                                            */
/******************************************************************************/

