betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_eth.h
/* DMA drop TCPIP checksum error frame enable or disable */
#define ETH_DropTCPIPChecksumErrorFrame_Enable ((uint32_t)0x00000000)
#define ETH_DropTCPIPChecksumErrorFrame_Disable ((uint32_t)0x04000000)

/* DMA receive store forward enable or disable */
#define ETH_ReceiveStoreForward_Enable ((uint32_t)0x02000000)
#define ETH_ReceiveStoreForward_Disable ((uint32_t)0x00000000)

/* DMA flush received frame enable or disable */
#define ETH_FlushReceivedFrame_Enable ((uint32_t)0x00000000)
#define ETH_FlushReceivedFrame_Disable ((uint32_t)0x01000000)

/* DMA transmit store forward enable or disable */
#define ETH_TransmitStoreForward_Enable ((uint32_t)0x00200000)
#define ETH_TransmitStoreForward_Disable ((uint32_t)0x00000000)

/* DMA transmit threshold control */
#define ETH_TransmitThresholdControl_64Bytes                                   \
  ((uint32_t)0x00000000) /* threshold level of the MTL Transmit FIFO is 64     \
                            Bytes */
#define ETH_TransmitThresholdControl_128Bytes                                  \
  ((uint32_t)0x00004000) /* threshold level of the MTL Transmit FIFO is 128    \
                            Bytes */
#define ETH_TransmitThresholdControl_192Bytes                                  \
  ((uint32_t)0x00008000) /* threshold level of the MTL Transmit FIFO is 192    \
                            Bytes */
#define ETH_TransmitThresholdControl_256Bytes                                  \
  ((uint32_t)0x0000C000) /* threshold level of the MTL Transmit FIFO is 256    \
                            Bytes */
#define ETH_TransmitThresholdControl_40Bytes                                   \
  ((uint32_t)0x00010000) /* threshold level of the MTL Transmit FIFO is 40     \
                            Bytes */
#define ETH_TransmitThresholdControl_32Bytes                                   \
  ((uint32_t)0x00014000) /* threshold level of the MTL Transmit FIFO is 32     \
                            Bytes */
#define ETH_TransmitThresholdControl_24Bytes                                   \
  ((uint32_t)0x00018000) /* threshold level of the MTL Transmit FIFO is 24     \
                            Bytes */
#define ETH_TransmitThresholdControl_16Bytes                                   \
  ((uint32_t)0x0001C000) /* threshold level of the MTL Transmit FIFO is 16     \
                            Bytes */

/* DMA forward error frames */
#define ETH_ForwardErrorFrames_Enable ((uint32_t)0x00000080)
#define ETH_ForwardErrorFrames_Disable ((uint32_t)0x00000000)

/* DMA forward undersized good frames enable or disable */
#define ETH_ForwardUndersizedGoodFrames_Enable ((uint32_t)0x00000040)
#define ETH_ForwardUndersizedGoodFrames_Disable ((uint32_t)0x00000000)

/* DMA receive threshold control */
#define ETH_ReceiveThresholdControl_64Bytes                                    \
  ((uint32_t)0x00000000) /* threshold level of the MTL Receive FIFO is 64      \
                            Bytes */
#define ETH_ReceiveThresholdControl_32Bytes                                    \
  ((uint32_t)0x00000008) /* threshold level of the MTL Receive FIFO is 32      \
                            Bytes */
#define ETH_ReceiveThresholdControl_96Bytes                                    \
  ((uint32_t)0x00000010) /* threshold level of the MTL Receive FIFO is 96      \
                            Bytes */
#define ETH_ReceiveThresholdControl_128Bytes                                   \
  ((uint32_t)0x00000018) /* threshold level of the MTL Receive FIFO is 128     \
                            Bytes */

/* DMA second frame operate enable or disable */
#define ETH_SecondFrameOperate_Enable ((uint32_t)0x00000004)
#define ETH_SecondFrameOperate_Disable ((uint32_t)0x00000000)

/* Address aligned beats enable or disable */
#define ETH_AddressAlignedBeats_Enable ((uint32_t)0x02000000)
#define ETH_AddressAlignedBeats_Disable ((uint32_t)0x00000000)

/* DMA Fixed burst enable or disable */
#define ETH_FixedBurst_Enable ((uint32_t)0x00010000)
#define ETH_FixedBurst_Disable ((uint32_t)0x00000000)

/* RX DMA burst length */
#define ETH_RxDMABurstLength_1Beat                                             \
  ((uint32_t)0x00020000) /* maximum number of beats to be transferred in one   \
                            RxDMA transaction is 1 */
#define ETH_RxDMABurstLength_2Beat                                             \
  ((uint32_t)0x00040000) /* maximum number of beats to be transferred in one   \
                            RxDMA transaction is 2 */
#define ETH_RxDMABurstLength_4Beat                                             \
  ((uint32_t)0x00080000) /* maximum number of beats to be transferred in one   \
                            RxDMA transaction is 4 */
#define ETH_RxDMABurstLength_8Beat                                             \
  ((uint32_t)0x00100000) /* maximum number of beats to be transferred in one   \
                            RxDMA transaction is 8 */
#define ETH_RxDMABurstLength_16Beat                                            \
  ((uint32_t)0x00200000) /* maximum number of beats to be transferred in one   \
                            RxDMA transaction is 16 */
#define ETH_RxDMABurstLength_32Beat                                            \
  ((uint32_t)0x00400000) /* maximum number of beats to be transferred in one   \
                            RxDMA transaction is 32 */
#define ETH_RxDMABurstLength_4xPBL_4Beat                                       \
  ((uint32_t)0x01020000) /* maximum number of beats to be transferred in one   \
                            RxDMA transaction is 4 */
#define ETH_RxDMABurstLength_4xPBL_8Beat                                       \
  ((uint32_t)0x01040000) /* maximum number of beats to be transferred in one   \
                            RxDMA transaction is 8 */
#define ETH_RxDMABurstLength_4xPBL_16Beat                                      \
  ((uint32_t)0x01080000) /* maximum number of beats to be transferred in one   \
                            RxDMA transaction is 16 */
#define ETH_RxDMABurstLength_4xPBL_32Beat                                      \
  ((uint32_t)0x01100000) /* maximum number of beats to be transferred in one   \
                            RxDMA transaction is 32 */
#define ETH_RxDMABurstLength_4xPBL_64Beat                                      \
  ((uint32_t)0x01200000) /* maximum number of beats to be transferred in one   \
                            RxDMA transaction is 64 */
#define ETH_RxDMABurstLength_4xPBL_128Beat                                     \
  ((uint32_t)0x01400000) /* maximum number of beats to be transferred in one   \
                            RxDMA transaction is 128 */

/* TX DMA burst length */
#define ETH_TxDMABurstLength_1Beat                                             \
  ((uint32_t)0x00000100) /* maximum number of beats to be transferred in one   \
                            TxDMA (or both) transaction is 1 */
#define ETH_TxDMABurstLength_2Beat                                             \
  ((uint32_t)0x00000200) /* maximum number of beats to be transferred in one   \
                            TxDMA (or both) transaction is 2 */
#define ETH_TxDMABurstLength_4Beat                                             \
  ((uint32_t)0x00000400) /* maximum number of beats to be transferred in one   \
                            TxDMA (or both) transaction is 4 */
#define ETH_TxDMABurstLength_8Beat                                             \
  ((uint32_t)0x00000800) /* maximum number of beats to be transferred in one   \
                            TxDMA (or both) transaction is 8 */
#define ETH_TxDMABurstLength_16Beat                                            \
  ((uint32_t)0x00001000) /* maximum number of beats to be transferred in one   \
                            TxDMA (or both) transaction is 16 */
#define ETH_TxDMABurstLength_32Beat                                            \
  ((uint32_t)0x00002000) /* maximum number of beats to be transferred in one   \
                            TxDMA (or both) transaction is 32 */
#define ETH_TxDMABurstLength_4xPBL_4Beat                                       \
  ((uint32_t)0x01000100) /* maximum number of beats to be transferred in one   \
                            TxDMA (or both) transaction is 4 */
#define ETH_TxDMABurstLength_4xPBL_8Beat                                       \
  ((uint32_t)0x01000200) /* maximum number of beats to be transferred in one   \
                            TxDMA (or both) transaction is 8 */
#define ETH_TxDMABurstLength_4xPBL_16Beat                                      \
  ((uint32_t)0x01000400) /* maximum number of beats to be transferred in one   \
                            TxDMA (or both) transaction is 16 */
#define ETH_TxDMABurstLength_4xPBL_32Beat                                      \
  ((uint32_t)0x01000800) /* maximum number of beats to be transferred in one   \
                            TxDMA (or both) transaction is 32 */
#define ETH_TxDMABurstLength_4xPBL_64Beat                                      \
  ((uint32_t)0x01001000) /* maximum number of beats to be transferred in one   \
                            TxDMA (or both) transaction is 64 */
#define ETH_TxDMABurstLength_4xPBL_128Beat                                     \
  ((uint32_t)0x01002000) /* maximum number of beats to be transferred in one   \
                            TxDMA (or both) transaction is 128 */

/* DMA arbitration_round robin */
#define ETH_DMAArbitration_RoundRobin_RxTx_1_1 ((uint32_t)0x00000000)
#define ETH_DMAArbitration_RoundRobin_RxTx_2_1 ((uint32_t)0x00004000)
#define ETH_DMAArbitration_RoundRobin_RxTx_3_1 ((uint32_t)0x00008000)
#define ETH_DMAArbitration_RoundRobin_RxTx_4_1 ((uint32_t)0x0000C000)
#define ETH_DMAArbitration_RxPriorTx ((uint32_t)0x00000002)

/* DMA interrupt FALG */
#define ETH_DMA_FLAG_TST                                                       \
  ((uint32_t)0x20000000) /* Time-stamp trigger interrupt (on DMA) */
#define ETH_DMA_FLAG_PMT ((uint32_t)0x10000000) /* PMT interrupt (on DMA) */
#define ETH_DMA_FLAG_MMC ((uint32_t)0x08000000) /* MMC interrupt (on DMA) */
#define ETH_DMA_FLAG_DataTransferError                                         \
  ((uint32_t)0x00800000) /* Error bits 0-Rx DMA, 1-Tx DMA */
#define ETH_DMA_FLAG_ReadWriteError                                            \
  ((uint32_t)0x01000000) /* Error bits 0-write trnsf, 1-read transfr */
#define ETH_DMA_FLAG_AccessError                                               \
  ((uint32_t)0x02000000) /* Error bits 0-data buffer, 1-desc. access */
#define ETH_DMA_FLAG_NIS                                                       \
  ((uint32_t)0x00010000) /* Normal interrupt summary flag */
#define ETH_DMA_FLAG_AIS                                                       \
  ((uint32_t)0x00008000) /* Abnormal interrupt summary flag */
#define ETH_DMA_FLAG_ER ((uint32_t)0x00004000)  /* Early receive flag */
#define ETH_DMA_FLAG_FBE ((uint32_t)0x00002000) /* Fatal bus error flag */
#define ETH_DMA_FLAG_ET ((uint32_t)0x00000400)  /* Early transmit flag */
#define ETH_DMA_FLAG_RWT                                                       \
  ((uint32_t)0x00000200) /* Receive watchdog timeout flag */
#define ETH_DMA_FLAG_RPS                                                       \
  ((uint32_t)0x00000100) /* Receive process stopped flag */
#define ETH_DMA_FLAG_RBU                                                       \
  ((uint32_t)0x00000080) /* Receive buffer unavailable flag */
#define ETH_DMA_FLAG_R ((uint32_t)0x00000040)  /* Receive flag */
#define ETH_DMA_FLAG_TU ((uint32_t)0x00000020) /* Underflow flag */
#define ETH_DMA_FLAG_RO ((uint32_t)0x00000010) /* Overflow flag */
#define ETH_DMA_FLAG_TJT                                                       \
  ((uint32_t)0x00000008) /* Transmit jabber timeout flag */
#define ETH_DMA_FLAG_TBU                                                       \
  ((uint32_t)0x00000004) /* Transmit buffer unavailable flag */
#define ETH_DMA_FLAG_TPS                                                       \
  ((uint32_t)0x00000002) /* Transmit process stopped flag */
#define ETH_DMA_FLAG_T ((uint32_t)0x00000001) /* Transmit flag */

