betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_eth.h
/* DMA interrupt */
#define ETH_DMA_IT_PHYLINK                                                     \
  ((uint32_t)0x80000000) /* Internal PHY link status change interrupt */
#define ETH_DMA_IT_TST                                                         \
  ((uint32_t)0x20000000) /* Time-stamp trigger interrupt (on DMA) */
#define ETH_DMA_IT_PMT ((uint32_t)0x10000000) /* PMT interrupt (on DMA) */
#define ETH_DMA_IT_MMC ((uint32_t)0x08000000) /* MMC interrupt (on DMA) */
#define ETH_DMA_IT_NIS ((uint32_t)0x00010000) /* Normal interrupt summary */
#define ETH_DMA_IT_AIS ((uint32_t)0x00008000) /* Abnormal interrupt summary */
#define ETH_DMA_IT_ER ((uint32_t)0x00004000)  /* Early receive interrupt */
#define ETH_DMA_IT_FBE ((uint32_t)0x00002000) /* Fatal bus error interrupt */
#define ETH_DMA_IT_ET ((uint32_t)0x00000400)  /* Early transmit interrupt */
#define ETH_DMA_IT_RWT                                                         \
  ((uint32_t)0x00000200) /* Receive watchdog timeout interrupt */
#define ETH_DMA_IT_RPS                                                         \
  ((uint32_t)0x00000100) /* Receive process stopped interrupt */
#define ETH_DMA_IT_RBU                                                         \
  ((uint32_t)0x00000080) /* Receive buffer unavailable interrupt */
#define ETH_DMA_IT_R ((uint32_t)0x00000040)  /* Receive interrupt */
#define ETH_DMA_IT_TU ((uint32_t)0x00000020) /* Underflow interrupt */
#define ETH_DMA_IT_RO ((uint32_t)0x00000010) /* Overflow interrupt */
#define ETH_DMA_IT_TJT                                                         \
  ((uint32_t)0x00000008) /* Transmit jabber timeout interrupt */
#define ETH_DMA_IT_TBU                                                         \
  ((uint32_t)0x00000004) /* Transmit buffer unavailable interrupt */
#define ETH_DMA_IT_TPS                                                         \
  ((uint32_t)0x00000002) /* Transmit process stopped interrupt */
#define ETH_DMA_IT_T ((uint32_t)0x00000001) /* Transmit interrupt */

/* DMA transmit process */
#define ETH_DMA_TransmitProcess_Stopped                                        \
  ((uint32_t)0x00000000) /* Stopped - Reset or Stop Tx Command issued */
#define ETH_DMA_TransmitProcess_Fetching                                       \
  ((uint32_t)0x00100000) /* Running - fetching the Tx descriptor */
#define ETH_DMA_TransmitProcess_Waiting                                        \
  ((uint32_t)0x00200000) /* Running - waiting for status */
#define ETH_DMA_TransmitProcess_Reading                                        \
  ((uint32_t)0x00300000) /* Running - reading the data from host memory */
#define ETH_DMA_TransmitProcess_Suspended                                      \
  ((uint32_t)0x00600000) /* Suspended - Tx Desciptor unavailabe */
#define ETH_DMA_TransmitProcess_Closing                                        \
  ((uint32_t)0x00700000) /* Running - closing Rx descriptor */

/* DMA receive Process */
#define ETH_DMA_ReceiveProcess_Stopped                                         \
  ((uint32_t)0x00000000) /* Stopped - Reset or Stop Rx Command issued */
#define ETH_DMA_ReceiveProcess_Fetching                                        \
  ((uint32_t)0x00020000) /* Running - fetching the Rx descriptor */
#define ETH_DMA_ReceiveProcess_Waiting                                         \
  ((uint32_t)0x00060000) /* Running - waiting for packet */
#define ETH_DMA_ReceiveProcess_Suspended                                       \
  ((uint32_t)0x00080000) /* Suspended - Rx Desciptor unavailable */
#define ETH_DMA_ReceiveProcess_Closing                                         \
  ((uint32_t)0x000A0000) /* Running - closing descriptor */
#define ETH_DMA_ReceiveProcess_Queuing                                         \
  ((uint32_t)0x000E0000) /* Running - queuing the recieve frame into host      \
                            memory */

/* DMA overflow */
#define ETH_DMA_Overflow_RxFIFOCounter                                         \
  ((uint32_t)0x10000000) /* Overflow bit for FIFO overflow counter */
#define ETH_DMA_Overflow_MissedFrameCounter                                    \
  ((uint32_t)0x00010000) /* Overflow bit for missed frame counter */

/*********************************************************************************
 *                            Ethernet PMT defines
 **********************************************************************************/

/* PMT flag */
#define ETH_PMT_FLAG_WUFFRPR                                                   \
  ((uint32_t)0x80000000) /* Wake-Up Frame Filter Register Poniter Reset */
#define ETH_PMT_FLAG_WUFR ((uint32_t)0x00000040) /* Wake-Up Frame Received */
#define ETH_PMT_FLAG_MPR ((uint32_t)0x00000020)  /* Magic Packet Received */

/*********************************************************************************
 *                            Ethernet MMC defines
 **********************************************************************************/

/* MMC TX interrupt flag */
#define ETH_MMC_IT_TGF                                                         \
  ((uint32_t)0x00200000) /* When Tx good frame counter reaches half the        \
                            maximum value */
#define ETH_MMC_IT_TGFMSC                                                      \
  ((uint32_t)0x00008000) /* When Tx good multi col counter reaches half the    \
                            maximum value */
#define ETH_MMC_IT_TGFSC                                                       \
  ((uint32_t)0x00004000) /* When Tx good single col counter reaches half the   \
                            maximum value */

/* MMC RX interrupt flag */
#define ETH_MMC_IT_RGUF                                                        \
  ((uint32_t)0x10020000) /* When Rx good unicast frames counter reaches half   \
                            the maximum value */
#define ETH_MMC_IT_RFAE                                                        \
  ((uint32_t)0x10000040) /* When Rx alignment error counter reaches half the   \
                            maximum value */
#define ETH_MMC_IT_RFCE                                                        \
  ((uint32_t)0x10000020) /* When Rx crc error counter reaches half the maximum \
                            value */

