betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_eth.h
/* MMC description */
#define ETH_MMCCR ((uint32_t)0x00000100)       /* MMC CR register */
#define ETH_MMCRIR ((uint32_t)0x00000104)      /* MMC RIR register */
#define ETH_MMCTIR ((uint32_t)0x00000108)      /* MMC TIR register */
#define ETH_MMCRIMR ((uint32_t)0x0000010C)     /* MMC RIMR register */
#define ETH_MMCTIMR ((uint32_t)0x00000110)     /* MMC TIMR register */
#define ETH_MMCTGFSCCR ((uint32_t)0x0000014C)  /* MMC TGFSCCR register */
#define ETH_MMCTGFMSCCR ((uint32_t)0x00000150) /* MMC TGFMSCCR register */
#define ETH_MMCTGFCR ((uint32_t)0x00000168)    /* MMC TGFCR register */
#define ETH_MMCRFCECR ((uint32_t)0x00000194)   /* MMC RFCECR register */
#define ETH_MMCRFAECR ((uint32_t)0x00000198)   /* MMC RFAECR register */
#define ETH_MMCRGUFCR ((uint32_t)0x000001C4)   /* MMC RGUFCR register */

/*********************************************************************************
 *                            Ethernet PTP defines
 **********************************************************************************/

/* PTP fine update method or coarse Update method */
#define ETH_PTP_FineUpdate ((uint32_t)0x00000001)   /* Fine Update method */
#define ETH_PTP_CoarseUpdate ((uint32_t)0x00000000) /* Coarse Update method */

/* PTP time stamp control */
#define ETH_PTP_FLAG_TSARU ((uint32_t)0x00000020) /* Addend Register Update */
#define ETH_PTP_FLAG_TSITE                                                     \
  ((uint32_t)0x00000010) /* Time Stamp Interrupt Trigger */
#define ETH_PTP_FLAG_TSSTU ((uint32_t)0x00000008) /* Time Stamp Update */
#define ETH_PTP_FLAG_TSSTI ((uint32_t)0x00000004) /* Time Stamp Initialize */

/* PTP positive/negative time value */
#define ETH_PTP_PositiveTime ((uint32_t)0x00000000) /* Positive time value */
#define ETH_PTP_NegativeTime ((uint32_t)0x80000000) /* Negative time value */

/******************************************************************************/
/*                                                                            */
/*                                PTP Register */
/*                                                                            */
/******************************************************************************/
#define ETH_PTPTSCR ((uint32_t)0x00000700)  /* PTP TSCR register */
#define ETH_PTPSSIR ((uint32_t)0x00000704)  /* PTP SSIR register */
#define ETH_PTPTSHR ((uint32_t)0x00000708)  /* PTP TSHR register */
#define ETH_PTPTSLR ((uint32_t)0x0000070C)  /* PTP TSLR register */
#define ETH_PTPTSHUR ((uint32_t)0x00000710) /* PTP TSHUR register */
#define ETH_PTPTSLUR ((uint32_t)0x00000714) /* PTP TSLUR register */
#define ETH_PTPTSAR ((uint32_t)0x00000718)  /* PTP TSAR register */
#define ETH_PTPTTHR ((uint32_t)0x0000071C)  /* PTP TTHR register */
#define ETH_PTPTTLR ((uint32_t)0x00000720)  /* PTP TTLR register */

#define ETH_DMASR_TSTS                                                         \
  ((unsigned int)0x20000000) /* Time-stamp trigger status */
#define ETH_DMASR_PMTS ((unsigned int)0x10000000) /* PMT status */
#define ETH_DMASR_MMCS ((unsigned int)0x08000000) /* MMC status */
#define ETH_DMASR_EBS ((unsigned int)0x03800000)  /* Error bits status */
#define ETH_DMASR_EBS_DescAccess                                               \
  ((unsigned int)0x02000000) /* Error bits 0-data buffer, 1-desc. access */
#define ETH_DMASR_EBS_ReadTransf                                               \
  ((unsigned int)0x01000000) /* Error bits 0-write trnsf, 1-read transfr */
#define ETH_DMASR_EBS_DataTransfTx                                             \
  ((unsigned int)0x00800000) /* Error bits 0-Rx DMA, 1-Tx DMA */
#define ETH_DMASR_TPS ((unsigned int)0x00700000) /* Transmit process state */
#define ETH_DMASR_TPS_Stopped                                                  \
  ((unsigned int)0x00000000) /* Stopped - Reset or Stop Tx Command issued  */
#define ETH_DMASR_TPS_Fetching                                                 \
  ((unsigned int)0x00100000) /* Running - fetching the Tx descriptor */
#define ETH_DMASR_TPS_Waiting                                                  \
  ((unsigned int)0x00200000) /* Running - waiting for status */
#define ETH_DMASR_TPS_Reading                                                  \
  ((unsigned int)0x00300000) /* Running - reading the data from host memory */
#define ETH_DMASR_TPS_Suspended                                                \
  ((unsigned int)0x00600000) /* Suspended - Tx Descriptor unavailabe */
#define ETH_DMASR_TPS_Closing                                                  \
  ((unsigned int)0x00700000) /* Running - closing Rx descriptor */
#define ETH_DMASR_RPS ((unsigned int)0x000E0000) /* Receive process state */
#define ETH_DMASR_RPS_Stopped                                                  \
  ((unsigned int)0x00000000) /* Stopped - Reset or Stop Rx Command issued */
#define ETH_DMASR_RPS_Fetching                                                 \
  ((unsigned int)0x00020000) /* Running - fetching the Rx descriptor */
#define ETH_DMASR_RPS_Waiting                                                  \
  ((unsigned int)0x00060000) /* Running - waiting for packet */
#define ETH_DMASR_RPS_Suspended                                                \
  ((unsigned int)0x00080000) /* Suspended - Rx Descriptor unavailable */
#define ETH_DMASR_RPS_Closing                                                  \
  ((unsigned int)0x000A0000) /* Running - closing descriptor */
#define ETH_DMASR_RPS_Queuing                                                  \
  ((unsigned int)0x000E0000) /* Running - queuing the recieve frame into host  \
                                memory */
#define ETH_DMASR_NIS                                                          \
  ((unsigned int)0x00010000) /* Normal interrupt summary                       \
                              */
#define ETH_DMASR_AIS                                                          \
  ((unsigned int)0x00008000) /* Abnormal interrupt summary */
#define ETH_DMASR_ERS ((unsigned int)0x00004000)  /* Early receive status */
#define ETH_DMASR_FBES ((unsigned int)0x00002000) /* Fatal bus error status */
#define ETH_DMASR_ETS ((unsigned int)0x00000400)  /* Early transmit status */
#define ETH_DMASR_RWTS                                                         \
  ((unsigned int)0x00000200) /* Receive watchdog timeout status */
#define ETH_DMASR_RPSS                                                         \
  ((unsigned int)0x00000100) /* Receive process stopped status */
#define ETH_DMASR_RBUS                                                         \
  ((unsigned int)0x00000080) /* Receive buffer unavailable status */
#define ETH_DMASR_RS ((unsigned int)0x00000040) /* Receive status */
#define ETH_DMASR_TUS                                                          \
  ((unsigned int)0x00000020)                     /* Transmit underflow status  \
                                                  */
#define ETH_DMASR_ROS ((unsigned int)0x00000010) /* Receive overflow status */
#define ETH_DMASR_TJTS                                                         \
  ((unsigned int)0x00000008) /* Transmit jabber timeout status */
#define ETH_DMASR_TBUS                                                         \
  ((unsigned int)0x00000004) /* Transmit buffer unavailable status */
#define ETH_DMASR_TPSS                                                         \
  ((unsigned int)0x00000002) /* Transmit process stopped status */
#define ETH_DMASR_TS ((unsigned int)0x00000001) /* Transmit status */

/******************************************************************************/
/*                                                                            */
/*                          ETH MAC Register */
/*                                                                            */
/******************************************************************************/
#define ETH_MACCR_WD ((unsigned int)0x00800000)  /* Watchdog disable */
#define ETH_MACCR_JD ((unsigned int)0x00400000)  /* Jabber disable */
#define ETH_MACCR_IFG ((unsigned int)0x000E0000) /* Inter-frame gap */
#define ETH_MACCR_IFG_96Bit                                                    \
  ((unsigned int)0x00000000) /* Minimum IFG between frames during transmission \
                                is 96Bit */
#define ETH_MACCR_IFG_88Bit                                                    \
  ((unsigned int)0x00020000) /* Minimum IFG between frames during transmission \
                                is 88Bit */
#define ETH_MACCR_IFG_80Bit                                                    \
  ((unsigned int)0x00040000) /* Minimum IFG between frames during transmission \
                                is 80Bit */
#define ETH_MACCR_IFG_72Bit                                                    \
  ((unsigned int)0x00060000) /* Minimum IFG between frames during transmission \
                                is 72Bit */
#define ETH_MACCR_IFG_64Bit                                                    \
  ((unsigned int)0x00080000) /* Minimum IFG between frames during transmission \
                                is 64Bit */
#define ETH_MACCR_IFG_56Bit                                                    \
  ((unsigned int)0x000A0000) /* Minimum IFG between frames during transmission \
                                is 56Bit */
#define ETH_MACCR_IFG_48Bit                                                    \
  ((unsigned int)0x000C0000) /* Minimum IFG between frames during transmission \
                                is 48Bit */
#define ETH_MACCR_IFG_40Bit                                                    \
  ((unsigned int)0x000E0000) /* Minimum IFG between frames during transmission \
                                is 40Bit */
#define ETH_MACCR_CSD                                                          \
  ((unsigned int)0x00010000) /* Carrier sense disable (during transmission) */
#define ETH_MACCR_FES ((unsigned int)0x00004000)  /* Fast ethernet speed */
#define ETH_MACCR_ROD ((unsigned int)0x00002000)  /* Receive own disable */
#define ETH_MACCR_LM ((unsigned int)0x00001000)   /* loopback mode */
#define ETH_MACCR_DM ((unsigned int)0x00000800)   /* Duplex mode */
#define ETH_MACCR_IPCO ((unsigned int)0x00000400) /* IP Checksum offload */
#define ETH_MACCR_RD ((unsigned int)0x00000200)   /* Retry disable */
#define ETH_MACCR_APCS                                                         \
  ((unsigned int)0x00000080) /* Automatic Pad/CRC stripping */
#define ETH_MACCR_BL                                                           \
  ((unsigned int)0x00000060) /* Back-off limit: random integer number (r) of   \
                                slot time delays before reschedulinga          \
                                transmission attempt during retries after a    \
                                collision: 0 =< r <2^k */
#define ETH_MACCR_BL_10 ((unsigned int)0x00000000) /* k = min (n, 10) */
#define ETH_MACCR_BL_8 ((unsigned int)0x00000020)  /* k = min (n, 8) */
#define ETH_MACCR_BL_4 ((unsigned int)0x00000040)  /* k = min (n, 4) */
#define ETH_MACCR_BL_1 ((unsigned int)0x00000060)  /* k = min (n, 1) */
#define ETH_MACCR_DC ((unsigned int)0x00000010)    /* Defferal check */
#define ETH_MACCR_TE ((unsigned int)0x00000008)    /* Transmitter enable */
#define ETH_MACCR_RE ((unsigned int)0x00000004)    /* Receiver enable */

#define ETH_MACFFR_RA ((unsigned int)0x80000000)  /* Receive all */
#define ETH_MACFFR_HPF ((unsigned int)0x00000400) /* Hash or perfect filter */
#define ETH_MACFFR_SAF                                                         \
  ((unsigned int)0x00000200) /* Source address filter enable */
#define ETH_MACFFR_SAIF ((unsigned int)0x00000100) /* SA inverse filtering */
#define ETH_MACFFR_PCF                                                         \
  ((unsigned int)0x000000C0) /* Pass control frames: 3 cases */
#define ETH_MACFFR_PCF_BlockAll                                                \
  ((unsigned int)0x00000040) /* MAC filters all control frames from reaching   \
                                the application */
#define ETH_MACFFR_PCF_ForwardAll                                              \
  ((unsigned int)0x00000080) /* MAC forwards all control frames to application \
                                even if they fail the Address Filter */
#define ETH_MACFFR_PCF_ForwardPassedAddrFilter                                 \
  ((unsigned int)0x000000C0) /* MAC forwards control frames that pass the      \
                                Address Filter. */
#define ETH_MACFFR_BFD                                                         \
  ((unsigned int)0x00000020)                       /* Broadcast frame disable  \
                                                    */
#define ETH_MACFFR_PAM ((unsigned int)0x00000010)  /* Pass all mutlicast */
#define ETH_MACFFR_DAIF ((unsigned int)0x00000008) /* DA Inverse filtering */
#define ETH_MACFFR_HM ((unsigned int)0x00000004)   /* Hash multicast */
#define ETH_MACFFR_HU ((unsigned int)0x00000002)   /* Hash unicast */
#define ETH_MACFFR_PM ((unsigned int)0x00000001)   /* Promiscuous mode */

#define ETH_MACHTHR_HTH ((unsigned int)0xFFFFFFFF) /* Hash table high */
#define ETH_MACHTLR_HTL ((unsigned int)0xFFFFFFFF) /* Hash table low */

#define ETH_MACMIIAR_PA                                                        \
  ((unsigned int)0x0000F800) /* Physical layer address                         \
                              */
#define ETH_MACMIIAR_MR                                                        \
  ((unsigned int)0x000007C0) /* MII register in the selected PHY */
#define ETH_MACMIIAR_CR                                                        \
  ((unsigned int)0x0000001C) /* CR clock range: 6 cases                        \
                              */
#define ETH_MACMIIAR_CR_Div42                                                  \
  ((unsigned int)0x00000000) /* HCLK:60-100 MHz; MDC clock= HCLK/42 */
#define ETH_MACMIIAR_CR_Div16                                                  \
  ((unsigned int)0x00000008) /* HCLK:20-35 MHz; MDC clock= HCLK/16 */
#define ETH_MACMIIAR_CR_Div26                                                  \
  ((unsigned int)0x0000000C) /* HCLK:35-60 MHz; MDC clock= HCLK/26 */
#define ETH_MACMIIAR_MW ((unsigned int)0x00000002) /* MII write */
#define ETH_MACMIIAR_MB ((unsigned int)0x00000001) /* MII busy */
#define ETH_MACMIIDR_MD                                                        \
  ((unsigned int)0x0000FFFF) /* MII data: read/write data from/to PHY */
#define ETH_MACFCR_PT ((unsigned int)0xFFFF0000) /* Pause time */
#define ETH_MACFCR_ZQPD                                                        \
  ((unsigned int)0x00000080) /* Zero-quanta pause disable */
#define ETH_MACFCR_PLT                                                         \
  ((unsigned int)0x00000030) /* Pause low threshold: 4 cases */
#define ETH_MACFCR_PLT_Minus4                                                  \
  ((unsigned int)0x00000000) /* Pause time minus 4 slot times */
#define ETH_MACFCR_PLT_Minus28                                                 \
  ((unsigned int)0x00000010) /* Pause time minus 28 slot times */
#define ETH_MACFCR_PLT_Minus144                                                \
  ((unsigned int)0x00000020) /* Pause time minus 144 slot times */
#define ETH_MACFCR_PLT_Minus256                                                \
  ((unsigned int)0x00000030) /* Pause time minus 256 slot times */
#define ETH_MACFCR_UPFD                                                        \
  ((unsigned int)0x00000008) /* Unicast pause frame detect */
#define ETH_MACFCR_RFCE                                                        \
  ((unsigned int)0x00000004) /* Receive flow control enable */
#define ETH_MACFCR_TFCE                                                        \
  ((unsigned int)0x00000002) /* Transmit flow control enable */
#define ETH_MACFCR_FCBBPA                                                      \
  ((unsigned int)0x00000001) /* Flow control busy/backpressure activate */

#define ETH_MACVLANTR_VLANTC                                                   \
  ((unsigned int)0x00010000) /* 12-bit VLAN tag comparison */
#define ETH_MACVLANTR_VLANTI                                                   \
  ((unsigned int)0x0000FFFF) /* VLAN tag identifier (for receive frames) */

#define ETH_MACRWUFFR_D                                                        \
  ((unsigned int)0xFFFFFFFF) /* Wake-up frame filter register data */
/* Eight sequential Writes to this address (offset 0x28) will write all
Wake-UpFrame Filter Registers. Eight sequential Reads from this address (offset
0x28) will read all Wake-UpFrame Filter Registers. */

