betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_eth.h
/*
Wake-UpFrame Filter Reg0 : Filter 0 Byte Mask
Wake-UpFrame Filter Reg1 : Filter 1 Byte Mask
Wake-UpFrame Filter Reg2 : Filter 2 Byte Mask
Wake-UpFrame Filter Reg3 : Filter 3 Byte Mask
Wake-UpFrame Filter Reg4 : RSVD - Filter3 Command - RSVD - Filter2 Command -
                           RSVD - Filter1 Command - RSVD - Filter0 Command
Wake-UpFrame Filter Re5 : Filter3 Offset - Filter2 Offset - Filter1 Offset -
Filter0 Offset Wake-UpFrame Filter Re6 : Filter1 CRC16 - Filter0 CRC16
Wake-UpFrame Filter Re7 : Filter3 CRC16 - Filter2 CRC16 */

#define ETH_MACPMTCSR_WFFRPR                                                   \
  ((unsigned int)0x80000000) /* Wake-Up Frame Filter Register Pointer Reset */
#define ETH_MACPMTCSR_GU ((unsigned int)0x00000200) /* Global Unicast */
#define ETH_MACPMTCSR_WFR                                                      \
  ((unsigned int)0x00000040) /* Wake-Up Frame Received */
#define ETH_MACPMTCSR_MPR                                                      \
  ((unsigned int)0x00000020) /* Magic Packet Received                          \
                              */
#define ETH_MACPMTCSR_WFE                                                      \
  ((unsigned int)0x00000004)                         /* Wake-Up Frame Enable   \
                                                      */
#define ETH_MACPMTCSR_MPE ((unsigned int)0x00000002) /* Magic Packet Enable */
#define ETH_MACPMTCSR_PD ((unsigned int)0x00000001)  /* Power Down */

#define ETH_MACSR_TSTS                                                         \
  ((unsigned int)0x00000200) /* Time stamp trigger status */
#define ETH_MACSR_MMCTS ((unsigned int)0x00000040)  /* MMC transmit status */
#define ETH_MACSR_MMMCRS ((unsigned int)0x00000020) /* MMC receive status */
#define ETH_MACSR_MMCS ((unsigned int)0x00000010)   /* MMC status */
#define ETH_MACSR_PMTS ((unsigned int)0x00000008)   /* PMT status */

#define ETH_MACIMR_TSTIM                                                       \
  ((unsigned int)0x00000200) /* Time stamp trigger interrupt mask */
#define ETH_MACIMR_PMTIM ((unsigned int)0x00000008) /* PMT interrupt mask */

#define ETH_MACA0HR_MACA0H ((unsigned int)0x0000FFFF) /* MAC address0 high */

#define ETH_MACA0LR_MACA0L ((unsigned int)0xFFFFFFFF) /* MAC address0 low */

#define ETH_MACA1HR_AE ((unsigned int)0x80000000) /* Address enable */
#define ETH_MACA1HR_SA ((unsigned int)0x40000000) /* Source address */
#define ETH_MACA1HR_MBC                                                        \
  ((unsigned int)0x3F000000) /* Mask byte control: bits to mask for comparison \
                                of the MAC Address bytes */
#define ETH_MACA1HR_MBC_HBits15_8                                              \
  ((unsigned int)0x20000000) /* Mask MAC Address high reg bits [15:8] */
#define ETH_MACA1HR_MBC_HBits7_0                                               \
  ((unsigned int)0x10000000) /* Mask MAC Address high reg bits [7:0] */
#define ETH_MACA1HR_MBC_LBits31_24                                             \
  ((unsigned int)0x08000000) /* Mask MAC Address low reg bits [31:24] */
#define ETH_MACA1HR_MBC_LBits23_16                                             \
  ((unsigned int)0x04000000) /* Mask MAC Address low reg bits [23:16] */
#define ETH_MACA1HR_MBC_LBits15_8                                              \
  ((unsigned int)0x02000000) /* Mask MAC Address low reg bits [15:8] */
#define ETH_MACA1HR_MBC_LBits7_0                                               \
  ((unsigned int)0x01000000) /* Mask MAC Address low reg bits [7:0] */
#define ETH_MACA1HR_MACA1H ((unsigned int)0x0000FFFF) /* MAC address1 high */

#define ETH_MACA1LR_MACA1L ((unsigned int)0xFFFFFFFF) /* MAC address1 low */

#define ETH_MACA2HR_AE ((unsigned int)0x80000000)  /* Address enable */
#define ETH_MACA2HR_SA ((unsigned int)0x40000000)  /* Source address */
#define ETH_MACA2HR_MBC ((unsigned int)0x3F000000) /* Mask byte control */
#define ETH_MACA2HR_MBC_HBits15_8                                              \
  ((unsigned int)0x20000000) /* Mask MAC Address high reg bits [15:8] */
#define ETH_MACA2HR_MBC_HBits7_0                                               \
  ((unsigned int)0x10000000) /* Mask MAC Address high reg bits [7:0] */
#define ETH_MACA2HR_MBC_LBits31_24                                             \
  ((unsigned int)0x08000000) /* Mask MAC Address low reg bits [31:24] */
#define ETH_MACA2HR_MBC_LBits23_16                                             \
  ((unsigned int)0x04000000) /* Mask MAC Address low reg bits [23:16] */
#define ETH_MACA2HR_MBC_LBits15_8                                              \
  ((unsigned int)0x02000000) /* Mask MAC Address low reg bits [15:8] */
#define ETH_MACA2HR_MBC_LBits7_0                                               \
  ((unsigned int)0x01000000) /* Mask MAC Address low reg bits [70] */

#define ETH_MACA2HR_MACA2H ((unsigned int)0x0000FFFF) /* MAC address1 high */
#define ETH_MACA2LR_MACA2L ((unsigned int)0xFFFFFFFF) /* MAC address2 low */

#define ETH_MACA3HR_AE ((unsigned int)0x80000000)  /* Address enable */
#define ETH_MACA3HR_SA ((unsigned int)0x40000000)  /* Source address */
#define ETH_MACA3HR_MBC ((unsigned int)0x3F000000) /* Mask byte control */
#define ETH_MACA3HR_MBC_HBits15_8                                              \
  ((unsigned int)0x20000000) /* Mask MAC Address high reg bits [15:8] */
#define ETH_MACA3HR_MBC_HBits7_0                                               \
  ((unsigned int)0x10000000) /* Mask MAC Address high reg bits [7:0] */
#define ETH_MACA3HR_MBC_LBits31_24                                             \
  ((unsigned int)0x08000000) /* Mask MAC Address low reg bits [31:24] */
#define ETH_MACA3HR_MBC_LBits23_16                                             \
  ((unsigned int)0x04000000) /* Mask MAC Address low reg bits [23:16] */
#define ETH_MACA3HR_MBC_LBits15_8                                              \
  ((unsigned int)0x02000000) /* Mask MAC Address low reg bits [15:8] */
#define ETH_MACA3HR_MBC_LBits7_0                                               \
  ((unsigned int)0x01000000) /* Mask MAC Address low reg bits [70] */
#define ETH_MACA3HR_MACA3H ((unsigned int)0x0000FFFF) /* MAC address3 high */
#define ETH_MACA3LR_MACA3L ((unsigned int)0xFFFFFFFF) /* MAC address3 low */

/******************************************************************************/
/* */
/*                          ETH MMC Register */
/*                                           */
/******************************************************************************/
#define ETH_MMCCR_MCFHP                                                        \
  ((unsigned int)0x00000020) /* MMC counter Full-Half preset */
#define ETH_MMCCR_MCP ((unsigned int)0x00000010) /* MMC counter preset */
#define ETH_MMCCR_MCF ((unsigned int)0x00000008) /* MMC Counter Freeze */
#define ETH_MMCCR_ROR ((unsigned int)0x00000004) /* Reset on Read */
#define ETH_MMCCR_CSR ((unsigned int)0x00000002) /* Counter Stop Rollover */
#define ETH_MMCCR_CR ((unsigned int)0x00000001)  /* Counters Reset */

#define ETH_MMCRIR_RGUFS                                                       \
  ((unsigned int)0x00020000) /* Set when Rx good unicast frames counter        \
                                reaches half the maximum value */
#define ETH_MMCRIR_RFAES                                                       \
  ((unsigned int)0x00000040) /* Set when Rx alignment error counter reaches    \
                                half the maximum value */
#define ETH_MMCRIR_RFCES                                                       \
  ((unsigned int)0x00000020) /* Set when Rx crc error counter reaches half the \
                                maximum value */

