betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_eth.h
#define ETH_MMCTIR_TGFS                                                        \
  ((unsigned int)0x00200000) /* Set when Tx good frame count counter reaches   \
                                half the maximum value */
#define ETH_MMCTIR_TGFMSCS                                                     \
  ((unsigned int)0x00008000) /* Set when Tx good multi col counter reaches     \
                                half the maximum value */
#define ETH_MMCTIR_TGFSCS                                                      \
  ((unsigned int)0x00004000) /* Set when Tx good single col counter reaches    \
                                half the maximum value */

#define ETH_MMCRIMR_RGUFM                                                      \
  ((unsigned int)0x00020000) /* Mask the interrupt when Rx good unicast frames \
                                counter reaches half the maximum value */
#define ETH_MMCRIMR_RFAEM                                                      \
  ((unsigned int)0x00000040) /* Mask the interrupt when when Rx alignment      \
                                error counter reaches half the maximum value   \
                              */
#define ETH_MMCRIMR_RFCEM                                                      \
  ((unsigned int)0x00000020) /* Mask the interrupt when Rx crc error counter   \
                                reaches half the maximum value */

#define ETH_MMCTIMR_TGFM                                                       \
  ((unsigned int)0x00200000) /* Mask the interrupt when Tx good frame count    \
                                counter reaches half the maximum value */
#define ETH_MMCTIMR_TGFMSCM                                                    \
  ((unsigned int)0x00008000) /* Mask the interrupt when Tx good multi col      \
                                counter reaches half the maximum value */
#define ETH_MMCTIMR_TGFSCM                                                     \
  ((unsigned int)0x00004000) /* Mask the interrupt when Tx good single col     \
                                counter reaches half the maximum value */

#define ETH_MMCTGFSCCR_TGFSCC                                                  \
  ((unsigned int)0xFFFFFFFF) /* Number of successfully transmitted frames      \
                                after a single collision in Half-duplex mode.  \
                              */

#define ETH_MMCTGFMSCCR_TGFMSCC                                                \
  ((unsigned int)0xFFFFFFFF) /* Number of successfully transmitted frames      \
                                after more than a single collision in          \
                                Half-duplex mode. */

#define ETH_MMCTGFCR_TGFC                                                      \
  ((unsigned int)0xFFFFFFFF) /* Number of good frames transmitted. */

#define ETH_MMCRFCECR_RFCEC                                                    \
  ((unsigned int)0xFFFFFFFF) /* Number of frames received with CRC error. */

#define ETH_MMCRFAECR_RFAEC                                                    \
  ((unsigned int)0xFFFFFFFF) /* Number of frames received with alignment       \
                                (dribble) error */

#define ETH_MMCRGUFCR_RGUFC                                                    \
  ((unsigned int)0xFFFFFFFF) /* Number of good unicast frames received. */

/******************************************************************************/
//
//                         ETH Precise Clock Protocol Register
//
/******************************************************************************/
#define ETH_PTPTSCR_TSCNT                                                      \
  ((unsigned int)0x00030000) /* Time stamp clock node type */
#define ETH_PTPTSSR_TSSMRME                                                    \
  ((unsigned int)0x00008000) /* Time stamp snapshot for message relevant to    \
                                master enable */
#define ETH_PTPTSSR_TSSEME                                                     \
  ((unsigned int)0x00004000) /* Time stamp snapshot for event message enable   \
                              */
#define ETH_PTPTSSR_TSSIPV4FE                                                  \
  ((unsigned int)0x00002000) /* Time stamp snapshot for IPv4 frames enable */
#define ETH_PTPTSSR_TSSIPV6FE                                                  \
  ((unsigned int)0x00001000) /* Time stamp snapshot for IPv6 frames enable */
#define ETH_PTPTSSR_TSSPTPOEFE                                                 \
  ((unsigned int)0x00000800) /* Time stamp snapshot for PTP over ethernet      \
                                frames enable */
#define ETH_PTPTSSR_TSPTPPSV2E                                                 \
  ((unsigned int)0x00000400) /* Time stamp PTP packet snooping for version2    \
                                format enable */
#define ETH_PTPTSSR_TSSSR                                                      \
  ((unsigned int)0x00000200) /* Time stamp Sub-seconds rollover */
#define ETH_PTPTSSR_TSSARFE                                                    \
  ((unsigned int)0x00000100) /* Time stamp snapshot for all received frames    \
                                enable */

#define ETH_PTPTSCR_TSARU                                                      \
  ((unsigned int)0x00000020) /* Addend register update */
#define ETH_PTPTSCR_TSITE                                                      \
  ((unsigned int)0x00000010) /* Time stamp interrupt trigger enable */
#define ETH_PTPTSCR_TSSTU ((unsigned int)0x00000008) /* Time stamp update */
#define ETH_PTPTSCR_TSSTI                                                      \
  ((unsigned int)0x00000004) /* Time stamp initialize                          \
                              */
#define ETH_PTPTSCR_TSFCU                                                      \
  ((unsigned int)0x00000002) /* Time stamp fine or coarse update */
#define ETH_PTPTSCR_TSE ((unsigned int)0x00000001) /* Time stamp enable */

#define ETH_PTPSSIR_STSSI                                                      \
  ((unsigned int)0x000000FF) /* System time Sub-second increment value */

#define ETH_PTPTSHR_STS ((unsigned int)0xFFFFFFFF) /* System Time second */

