betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_eth.h
#define ETH_PTPTSLR_STPNS                                                      \
  ((unsigned int)0x80000000) /* System Time Positive or negative time */
#define ETH_PTPTSLR_STSS                                                       \
  ((unsigned int)0x7FFFFFFF) /* System Time sub-seconds */

#define ETH_PTPTSHUR_TSUS                                                      \
  ((unsigned int)0xFFFFFFFF) /* Time stamp update seconds */

#define ETH_PTPTSLUR_TSUPNS                                                    \
  ((unsigned int)0x80000000) /* Time stamp update Positive or negative time */
#define ETH_PTPTSLUR_TSUSS                                                     \
  ((unsigned int)0x7FFFFFFF) /* Time stamp update sub-seconds */

#define ETH_PTPTSAR_TSA ((unsigned int)0xFFFFFFFF) /* Time stamp addend */

#define ETH_PTPTTHR_TTSH                                                       \
  ((unsigned int)0xFFFFFFFF) /* Target time stamp high                         \
                              */

#define ETH_PTPTTLR_TTSL                                                       \
  ((unsigned int)0xFFFFFFFF) /* Target time stamp low                          \
                              */

#define ETH_PTPTSSR_TSTTR                                                      \
  ((unsigned int)0x00000020) /* Time stamp target time reached */
#define ETH_PTPTSSR_TSSO                                                       \
  ((unsigned int)0x00000010) /* Time stamp seconds overflow */

/******************************************************************************/
//
//                      ETH DMA Register
///
/******************************************************************************/
#define ETH_DMABMR_AAB ((unsigned int)0x02000000) /* Address-Aligned beats */
#define ETH_DMABMR_FPM ((unsigned int)0x01000000) /* 4xPBL mode */
#define ETH_DMABMR_USP ((unsigned int)0x00800000) /* Use separate PBL */
#define ETH_DMABMR_RDP ((unsigned int)0x007E0000) /* RxDMA PBL */
#define ETH_DMABMR_RDP_1Beat                                                   \
  ((unsigned int)0x00020000) /* maximum number of beats to be transferred in   \
                                one RxDMA transaction is 1 */
#define ETH_DMABMR_RDP_2Beat                                                   \
  ((unsigned int)0x00040000) /* maximum number of beats to be transferred in   \
                                one RxDMA transaction is 2 */
#define ETH_DMABMR_RDP_4Beat                                                   \
  ((unsigned int)0x00080000) /* maximum number of beats to be transferred in   \
                                one RxDMA transaction is 4 */
#define ETH_DMABMR_RDP_8Beat                                                   \
  ((unsigned int)0x00100000) /* maximum number of beats to be transferred in   \
                                one RxDMA transaction is 8 */
#define ETH_DMABMR_RDP_16Beat                                                  \
  ((unsigned int)0x00200000) /* maximum number of beats to be transferred in   \
                                one RxDMA transaction is 16 */
#define ETH_DMABMR_RDP_32Beat                                                  \
  ((unsigned int)0x00400000) /* maximum number of beats to be transferred in   \
                                one RxDMA transaction is 32 */
#define ETH_DMABMR_RDP_4xPBL_4Beat                                             \
  ((unsigned int)0x01020000) /* maximum number of beats to be transferred in   \
                                one RxDMA transaction is 4 */
#define ETH_DMABMR_RDP_4xPBL_8Beat                                             \
  ((unsigned int)0x01040000) /* maximum number of beats to be transferred in   \
                                one RxDMA transaction is 8 */
#define ETH_DMABMR_RDP_4xPBL_16Beat                                            \
  ((unsigned int)0x01080000) /* maximum number of beats to be transferred in   \
                                one RxDMA transaction is 16 */
#define ETH_DMABMR_RDP_4xPBL_32Beat                                            \
  ((unsigned int)0x01100000) /* maximum number of beats to be transferred in   \
                                one RxDMA transaction is 32 */
#define ETH_DMABMR_RDP_4xPBL_64Beat                                            \
  ((unsigned int)0x01200000) /* maximum number of beats to be transferred in   \
                                one RxDMA transaction is 64 */
#define ETH_DMABMR_RDP_4xPBL_128Beat                                           \
  ((unsigned int)0x01400000) /* maximum number of beats to be transferred in   \
                                one RxDMA transaction is 128 */
#define ETH_DMABMR_FB ((unsigned int)0x00010000)   /* Fixed Burst */
#define ETH_DMABMR_RTPR ((unsigned int)0x0000C000) /* Rx Tx priority ratio */
#define ETH_DMABMR_RTPR_1_1                                                    \
  ((unsigned int)0x00000000) /* Rx Tx priority ratio */
#define ETH_DMABMR_RTPR_2_1                                                    \
  ((unsigned int)0x00004000) /* Rx Tx priority ratio */
#define ETH_DMABMR_RTPR_3_1                                                    \
  ((unsigned int)0x00008000) /* Rx Tx priority ratio */
#define ETH_DMABMR_RTPR_4_1                                                    \
  ((unsigned int)0x0000C000) /* Rx Tx priority ratio */
#define ETH_DMABMR_PBL                                                         \
  ((unsigned int)0x00003F00) /* Programmable burst length */
#define ETH_DMABMR_PBL_1Beat                                                   \
  ((unsigned int)0x00000100) /* maximum number of beats to be transferred in   \
                                one TxDMA (or both) transaction is 1 */
#define ETH_DMABMR_PBL_2Beat                                                   \
  ((unsigned int)0x00000200) /* maximum number of beats to be transferred in   \
                                one TxDMA (or both) transaction is 2 */
#define ETH_DMABMR_PBL_4Beat                                                   \
  ((unsigned int)0x00000400) /* maximum number of beats to be transferred in   \
                                one TxDMA (or both) transaction is 4 */
#define ETH_DMABMR_PBL_8Beat                                                   \
  ((unsigned int)0x00000800) /* maximum number of beats to be transferred in   \
                                one TxDMA (or both) transaction is 8 */
#define ETH_DMABMR_PBL_16Beat                                                  \
  ((unsigned int)0x00001000) /* maximum number of beats to be transferred in   \
                                one TxDMA (or both) transaction is 16 */
#define ETH_DMABMR_PBL_32Beat                                                  \
  ((unsigned int)0x00002000) /* maximum number of beats to be transferred in   \
                                one TxDMA (or both) transaction is 32 */
#define ETH_DMABMR_PBL_4xPBL_4Beat                                             \
  ((unsigned int)0x01000100) /* maximum number of beats to be transferred in   \
                                one TxDMA (or both) transaction is 4 */
#define ETH_DMABMR_PBL_4xPBL_8Beat                                             \
  ((unsigned int)0x01000200) /* maximum number of beats to be transferred in   \
                                one TxDMA (or both) transaction is 8 */
#define ETH_DMABMR_PBL_4xPBL_16Beat                                            \
  ((unsigned int)0x01000400) /* maximum number of beats to be transferred in   \
                                one TxDMA (or both) transaction is 16 */
#define ETH_DMABMR_PBL_4xPBL_32Beat                                            \
  ((unsigned int)0x01000800) /* maximum number of beats to be transferred in   \
                                one TxDMA (or both) transaction is 32 */
#define ETH_DMABMR_PBL_4xPBL_64Beat                                            \
  ((unsigned int)0x01001000) /* maximum number of beats to be transferred in   \
                                one TxDMA (or both) transaction is 64 */
#define ETH_DMABMR_PBL_4xPBL_128Beat                                           \
  ((unsigned int)0x01002000) /* maximum number of beats to be transferred in   \
                                one TxDMA (or both) transaction is 128 */
#define ETH_DMABMR_EDE                                                         \
  ((unsigned int)0x00000080) /* Enhanced Descriptor Enable */
#define ETH_DMABMR_DSL ((unsigned int)0x0000007C) /* Descriptor Skip Length */
#define ETH_DMABMR_DA ((unsigned int)0x00000002)  /* DMA arbitration scheme */
#define ETH_DMABMR_SR ((unsigned int)0x00000001)  /* Software reset */

#define ETH_DMATPDR_TPD ((unsigned int)0xFFFFFFFF) /* Transmit poll demand */

#define ETH_DMARPDR_RPD ((unsigned int)0xFFFFFFFF) /* Receive poll demand  */

#define ETH_DMARDLAR_SRL                                                       \
  ((unsigned int)0xFFFFFFFF) /* Start of receive list                          \
                              */

#define ETH_DMATDLAR_STL                                                       \
  ((unsigned int)0xFFFFFFFF) /* Start of transmit list                         \
                              */

#define ETH_DMASR_TSTS                                                         \
  ((unsigned int)0x20000000) /* Time-stamp trigger status */
#define ETH_DMASR_PMTS ((unsigned int)0x10000000) /* PMT status */
#define ETH_DMASR_MMCS ((unsigned int)0x08000000) /* MMC status */
#define ETH_DMASR_EBS ((unsigned int)0x03800000)  /* Error bits status */
#define ETH_DMASR_EBS_DescAccess                                               \
  ((unsigned int)0x02000000) /* Error bits 0-data buffer, 1-desc. access */
#define ETH_DMASR_EBS_ReadTransf                                               \
  ((unsigned int)0x01000000) /* Error bits 0-write trnsf, 1-read transfr */
#define ETH_DMASR_EBS_DataTransfTx                                             \
  ((unsigned int)0x00800000) /* Error bits 0-Rx DMA, 1-Tx DMA */
#define ETH_DMASR_TPS ((unsigned int)0x00700000) /* Transmit process state */
#define ETH_DMASR_TPS_Stopped                                                  \
  ((unsigned int)0x00000000) /* Stopped - Reset or Stop Tx Command issued  */
#define ETH_DMASR_TPS_Fetching                                                 \
  ((unsigned int)0x00100000) /* Running - fetching the Tx descriptor */
#define ETH_DMASR_TPS_Waiting                                                  \
  ((unsigned int)0x00200000) /* Running - waiting for status */
#define ETH_DMASR_TPS_Reading                                                  \
  ((unsigned int)0x00300000) /* Running - reading the data from host memory */
#define ETH_DMASR_TPS_Suspended                                                \
  ((unsigned int)0x00600000) /* Suspended - Tx Descriptor unavailabe */
#define ETH_DMASR_TPS_Closing                                                  \
  ((unsigned int)0x00700000) /* Running - closing Rx descriptor */
#define ETH_DMASR_RPS ((unsigned int)0x000E0000) /* Receive process state */
#define ETH_DMASR_RPS_Stopped                                                  \
  ((unsigned int)0x00000000) /* Stopped - Reset or Stop Rx Command issued */
#define ETH_DMASR_RPS_Fetching                                                 \
  ((unsigned int)0x00020000) /* Running - fetching the Rx descriptor */
#define ETH_DMASR_RPS_Waiting                                                  \
  ((unsigned int)0x00060000) /* Running - waiting for packet */
#define ETH_DMASR_RPS_Suspended                                                \
  ((unsigned int)0x00080000) /* Suspended - Rx Descriptor unavailable */
#define ETH_DMASR_RPS_Closing                                                  \
  ((unsigned int)0x000A0000) /* Running - closing descriptor */
#define ETH_DMASR_RPS_Queuing                                                  \
  ((unsigned int)0x000E0000) /* Running - queuing the recieve frame into host  \
                                memory */
#define ETH_DMASR_NIS                                                          \
  ((unsigned int)0x00010000) /* Normal interrupt summary                       \
                              */
#define ETH_DMASR_AIS                                                          \
  ((unsigned int)0x00008000) /* Abnormal interrupt summary */
#define ETH_DMASR_ERS ((unsigned int)0x00004000)  /* Early receive status */
#define ETH_DMASR_FBES ((unsigned int)0x00002000) /* Fatal bus error status */
#define ETH_DMASR_ETS ((unsigned int)0x00000400)  /* Early transmit status */
#define ETH_DMASR_RWTS                                                         \
  ((unsigned int)0x00000200) /* Receive watchdog timeout status */
#define ETH_DMASR_RPSS                                                         \
  ((unsigned int)0x00000100) /* Receive process stopped status */
#define ETH_DMASR_RBUS                                                         \
  ((unsigned int)0x00000080) /* Receive buffer unavailable status */
#define ETH_DMASR_RS ((unsigned int)0x00000040) /* Receive status */
#define ETH_DMASR_TUS                                                          \
  ((unsigned int)0x00000020)                     /* Transmit underflow status  \
                                                  */
#define ETH_DMASR_ROS ((unsigned int)0x00000010) /* Receive overflow status */
#define ETH_DMASR_TJTS                                                         \
  ((unsigned int)0x00000008) /* Transmit jabber timeout status */
#define ETH_DMASR_TBUS                                                         \
  ((unsigned int)0x00000004) /* Transmit buffer unavailable status */
#define ETH_DMASR_TPSS                                                         \
  ((unsigned int)0x00000002) /* Transmit process stopped status */
#define ETH_DMASR_TS ((unsigned int)0x00000001) /* Transmit status */

#define ETH_DMAOMR_DTCEFD                                                      \
  ((unsigned int)0x04000000) /* Disable Dropping of TCP/IP checksum error      \
                                frames */
#define ETH_DMAOMR_RSF                                                         \
  ((unsigned int)0x02000000) /* Receive store and forward */
#define ETH_DMAOMR_DFRF                                                        \
  ((unsigned int)0x01000000) /* Disable flushing of received frames */
#define ETH_DMAOMR_TSF                                                         \
  ((unsigned int)0x00200000) /* Transmit store and forward */
#define ETH_DMAOMR_FTF ((unsigned int)0x00100000) /* Flush transmit FIFO */
#define ETH_DMAOMR_TTC                                                         \
  ((unsigned int)0x0001C000) /* Transmit threshold control */
#define ETH_DMAOMR_TTC_64Bytes                                                 \
  ((unsigned int)0x00000000) /* threshold level of the MTL Transmit FIFO is 64 \
                                Bytes */
#define ETH_DMAOMR_TTC_128Bytes                                                \
  ((unsigned int)0x00004000) /* threshold level of the MTL Transmit FIFO is    \
                                128 Bytes */
#define ETH_DMAOMR_TTC_192Bytes                                                \
  ((unsigned int)0x00008000) /* threshold level of the MTL Transmit FIFO is    \
                                192 Bytes */
#define ETH_DMAOMR_TTC_256Bytes                                                \
  ((unsigned int)0x0000C000) /* threshold level of the MTL Transmit FIFO is    \
                                256 Bytes */
#define ETH_DMAOMR_TTC_40Bytes                                                 \
  ((unsigned int)0x00010000) /* threshold level of the MTL Transmit FIFO is 40 \
                                Bytes */
#define ETH_DMAOMR_TTC_32Bytes                                                 \
  ((unsigned int)0x00014000) /* threshold level of the MTL Transmit FIFO is 32 \
                                Bytes */
#define ETH_DMAOMR_TTC_24Bytes                                                 \
  ((unsigned int)0x00018000) /* threshold level of the MTL Transmit FIFO is 24 \
                                Bytes */
#define ETH_DMAOMR_TTC_16Bytes                                                 \
  ((unsigned int)0x0001C000) /* threshold level of the MTL Transmit FIFO is 16 \
                                Bytes */
#define ETH_DMAOMR_ST                                                          \
  ((unsigned int)0x00002000) /* Start/stop transmission command */
#define ETH_DMAOMR_FEF ((unsigned int)0x00000080) /* Forward error frames */
#define ETH_DMAOMR_FUGF                                                        \
  ((unsigned int)0x00000040) /* Forward undersized good frames */
#define ETH_DMAOMR_RTC                                                         \
  ((unsigned int)0x00000018) /* receive threshold control */
#define ETH_DMAOMR_RTC_64Bytes                                                 \
  ((unsigned int)0x00000000) /* threshold level of the MTL Receive FIFO is 64  \
                                Bytes */
#define ETH_DMAOMR_RTC_32Bytes                                                 \
  ((unsigned int)0x00000008) /* threshold level of the MTL Receive FIFO is 32  \
                                Bytes */
#define ETH_DMAOMR_RTC_96Bytes                                                 \
  ((unsigned int)0x00000010) /* threshold level of the MTL Receive FIFO is 96  \
                                Bytes */
#define ETH_DMAOMR_RTC_128Bytes                                                \
  ((unsigned int)0x00000018) /* threshold level of the MTL Receive FIFO is 128 \
                                Bytes */
#define ETH_DMAOMR_OSF                                                         \
  ((unsigned int)0x00000004)                     /* operate on second frame    \
                                                  */
#define ETH_DMAOMR_SR ((unsigned int)0x00000002) /* Start/stop receive */

#define ETH_DMAIER_NISE                                                        \
  ((unsigned int)0x00010000) /* Normal interrupt summary enable */
#define ETH_DMAIER_AISE                                                        \
  ((unsigned int)0x00008000) /* Abnormal interrupt summary enable */
#define ETH_DMAIER_ERIE                                                        \
  ((unsigned int)0x00004000) /* Early receive interrupt enable */
#define ETH_DMAIER_FBEIE                                                       \
  ((unsigned int)0x00002000) /* Fatal bus error interrupt enable */
#define ETH_DMAIER_ETIE                                                        \
  ((unsigned int)0x00000400) /* Early transmit interrupt enable */
#define ETH_DMAIER_RWTIE                                                       \
  ((unsigned int)0x00000200) /* Receive watchdog timeout interrupt enable */
#define ETH_DMAIER_RPSIE                                                       \
  ((unsigned int)0x00000100) /* Receive process stopped interrupt enable */
#define ETH_DMAIER_RBUIE                                                       \
  ((unsigned int)0x00000080) /* Receive buffer unavailable interrupt enable */
#define ETH_DMAIER_RIE                                                         \
  ((unsigned int)0x00000040) /* Receive interrupt enable                       \
                              */
#define ETH_DMAIER_TUIE                                                        \
  ((unsigned int)0x00000020) /* Transmit Underflow interrupt enable */
#define ETH_DMAIER_ROIE                                                        \
  ((unsigned int)0x00000010) /* Receive Overflow interrupt enable */
#define ETH_DMAIER_TJTIE                                                       \
  ((unsigned int)0x00000008) /* Transmit jabber timeout interrupt enable */
#define ETH_DMAIER_TBUIE                                                       \
  ((unsigned int)0x00000004) /* Transmit buffer unavailable interrupt enable   \
                              */
#define ETH_DMAIER_TPSIE                                                       \
  ((unsigned int)0x00000002) /* Transmit process stopped interrupt enable */
#define ETH_DMAIER_TIE                                                         \
  ((unsigned int)0x00000001) /* Transmit interrupt enable */

#define ETH_DMAMFBOCR_OFOC                                                     \
  ((unsigned int)0x10000000) /* Overflow bit for FIFO overflow counter */
#define ETH_DMAMFBOCR_MFA                                                      \
  ((unsigned int)0x0FFE0000) /* Number of frames missed by the application */
#define ETH_DMAMFBOCR_OMFC                                                     \
  ((unsigned int)0x00010000) /* Overflow bit for missed frame counter */
#define ETH_DMAMFBOCR_MFC                                                      \
  ((unsigned int)0x0000FFFF) /* Number of frames missed by the controller */

